{
  "tajweed": [
    {
      "title": "مُختَصَر عِلْم التَّجْوِيد",
      "explanation": "شرح مُختصر لمبادئ علم التجويد: تعريفه، حكم تعلمه، مخارج الحروف وصفاتها، وأحكام النون والمد والغنة.",
      "mediaToggle": false,
      "sources": [
        { "title": "مقالة تجويد - ويكيبيديا العربية"},
        { "title": "التمهيد في علم التجويد - محمد بن الجزري (متن) (مرجع)" }
      ],
      "examples": "",
      "children": [
        {
          "title": "مدخل إلى علم التجويد",
          "explanation": "مقدمة تبين ماهية التجويد، أهمية تعلمه، وفضيلة إتقانه حفاظاً على ثبات ألفاظ القرآن.",
          "sources": [ { "title": "مقالة تجويد - ويكيبيديا العربية"} ],
          "examples": "",
          "children": [
            { "title": "تعريف التجويد", "explanation": "تحسين قراءة القرآن", "examples": "" },
            { "title": "حكم تعلم التجويد", "explanation": "الأخذ بأحكام التجويد والعمل بها مطلوب شرعاً؛ تعلمه يعتبر فرض كفاية في أوساط العلماء.", "examples": "" },
            { "title": "هدف علم التجويد", "explanation": "حماية ألفاظ القرآن من اللحن وإعطاء كل حرف حقّه في المخرج والصفة والمدة.", "examples": "" }
          ]
        },
        {
          "title": "فضل قراءة القرآن",
          "explanation": "بيان فضل تلاوة القرآن الكريم وأثر إتقان التلاوة في زيادة الأجر والثواب.",
          "children": [
            { "title": "فضل التلاوة", "explanation": "تلاوة القرآن بترتيل وتدبر لها فضل عظيم وتُقرب القارئ من المعاني والسلوك الإسلامي.", "examples": "" },
            { "title": "الأجر والثواب", "explanation": "إتقان التلاوة والعمل بأحكام التجويد يُثاب عليه القارئ ويزيد من أجر التلاوة وفق النصوص الشرعية.", "examples": "" }
          ]
        },
        {
          "title": "علم التجويد",
          "explanation": "تعريف علم التجويد، مقاصده، وفوائده في تحسين قراءة القرآن الكريم.",
          "children": [
            { "title": "أصل كلمة التجويد", "explanation": "في اللغة: التحسين والإحكام؛ وفي الاصطلاح: إعطاء كل حرف حقه من مخرج وصفة ومدّ.", "examples": "" },
            { "title": "مقاصده", "explanation": "تثبيت قراءة صحيحة تحفظ المعاني وتمنع تغيير الألفاظ أو الإخلال بالمقاصد القرآنية.", "examples": "" },
            { "title": "فوائده", "explanation": "الحدّ من اللحن، تحسين الصوت، وزيادة فهم القارئ لمعاني الآيات عبر الترتيل الصحيح.", "examples": "" }
          ]
        },
        {
          "title": "مخارج و صفات الحروف",
          "explanation": "تحديد أماكن خروج الحروف وصفاتها الصوتية التي تميز كل حرف عن الآخر في النطق الصحيح.",
          "children": [
            { "title": "مخرج الحرف", "explanation": "المكان الذي يخرج منه حرف (مثل الشفتين، طرف اللسان، الحلق)، وهو أساس النطق الصحيح.", "examples": "" },
            { "title": "ألقاب الحروف", "explanation": "تسميات أو مجموعات تُسهل تصنيف الحروف لتعليم المخارج والصفات.", "examples": "" },
            { "title": "المخارج الرئيسية", "explanation": "تقسيم المخارج إلى مجموعات رئيسية: الشفتان، اللسان بأجزاءه، الحلق، وما إلى ذلك.", "examples": "" },
            {
              "title": "صفات الحروف",
              "children": [
                { "title": "الصفات المتضادة", "explanation": "صفات صوتية تقع في مقابل بعضها (مثل الجهر والهمس) وتفصل بين أحرف متقاربة.", "examples": "" },
                { "title": "صفات لا ضد لها", "explanation": "صفات خاصة ببعض الحروف لا يُوجد لها نقيض مباشر مثل الغنة أو الإشمام.", "examples": "" }
              ]
            },
            { "title": "حروف الاستعلاء", "explanation": "حروف تُنطق بمكان مرتفع من الحلق وتسمى حروف الاستعلاء لتميزها بصوت مرتفع.", "examples": "" }
          ]
        },
        {
          "title": "أحكام النون الساكنة و التنوين",
          "explanation": "قواعد نطق النون الساكنة والتنوين في القرآن الكريم، وأنواعها المختلفة وتأثيرها على التجويد.",
          "children": [
            { "title": "الإظهار", "explanation": "نطق النون الساكنة أو التنوين بوضوح عند ما يليها أحد حروف الحلق دون غنة أو إدغام.", "examples": "" },
            { "title": "الإدغام", "explanation": "إدخال النون الساكنة أو التنوين في الحرف التالي بحيث تختفي النون أو تُدمج معها، ويُقسَّم إلى إدغام متماثل وجزئي.", "examples": "" },
            { "title": "الإقلاب", "explanation": "تحويل النون الساكنة أو التنوين إلى ميم مخفاة عند الوقوع قبل الباء مع صوت غنة خفيف.", "examples": "" },
            { "title": "الإخفاء", "explanation": "نطق النون بطريقة وسطية بين الإظهار والإدغام مع غنة خفيفة عند بعض الحروف المحددة.", "examples": "" },
            { "title": "الغنة", "explanation": "صوت أنفي يُسمع في أحكام النون والميم المشددة وبعض حالات الإدغام، ومدّها حسب الحكم المطبّق.", "examples": "" }
          ]
        },
        {
          "title": "أحكام المد في التجويد",
          "explanation": "قواعد تمديد الصوت عند نطق حروف المدّ في القرآن الكريم، وأنواع المدود المختلفة.",
          "children": [
            { "title": "المد الطبيعي", "explanation": "مد أصلي ناتج عن حرف مدّ (الألف، الواو، الياء) لا سببه همزة أو سكون؛ ومقداره عادة حركتان.", "examples": "" },
            { "title": "مد البدل", "explanation": "مد يحدث عندما تقع همزة بعد حرف مد في كلمة واحدة ويُعطى مقداراً معيناً حسب القاعدة المتبعة.", "examples": "" },
            { "title": "المد الواجب المتصل", "explanation": "مد واجب يظهر عند اتصال حرف المد بحرف ممدود من نفس الكلمة أو بقيادة سبب ويُعطى مدّاً أطول (مثل ثلاث أو أكثر حسب المذهب).", "examples": "" },
            { "title": "المد الجائز المنفصل", "explanation": "مدّ جائز ينتج عند التقاء حرف المد بنهاية كلمة وبداية أخرى، ويختلف مقداره حسب الرأي والمدود المقررة.", "examples": "" },
            { "title": "المد اللازم", "explanation": "مدّ لازم يلازم حرفاً مع الاستعلاء أو التشديد ويُعطى امتداداً طويلاً وثابتاً لا يجوز تقصيره.", "examples": "" },
            { "title": "المد العارض للسكون", "explanation": "مد يظهر عند الوقف على حرف معرّض للسكون نتيجة الوقف، ومدّه أوسط بين الطبيعي واللازم حسب الحالة.", "examples": "" },
            { "title": "مد الصلة", "explanation": "مد ينتج عن صلة لفظين في القراءة لكنه يختلف عند الوقف ويُقاس وفق القواعد المعيارية.", "examples": "" }
          ]
        }
      ]
    }
  ]
}
